Revit 2024 API
BuiltInFailures.ElectricalFailures.InvalidSpareSpace Property
 The number of poles for a spare/space in a single phase, [wire] wires panel cannot exceed [value].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidSpareSpace { get; }
Visual Basic
Public Shared ReadOnly Property InvalidSpareSpace As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidSpareSpace {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace